[net]
# Testing
#batch=64
#subdivisions=16
# Training
# Kaggle mods below
batch=64
subdivisions=16
width=416
height=416
# end Kaggle mods
channels=3
momentum=0.9
decay=0.000014545
angle=180
saturation = 1.5
exposure = 1.5
hue=0.1
adam=1
learning_rate=0.01
burn_in=1000
# Kaggle Mods
max_batches = 44000
steps=35200,39600
# end Kaggle mods
policy=steps
scales=0.1,0.1
aspect=0.75
mosaic=1
mosaic_bound=1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[route]
layers=-1
groups=2
group_id=1

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[route]
layers = -1,-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -6,-1

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

##################################

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
# Kaggle mods
filters=81
# end Kaggle mods
activation=linear



[yolo]
mask = 3,4,5
anchors =  16, 18,  20, 44,  36, 27,  39, 46,  28, 73,  69, 56,  75,115, 154,204, 294,313
counters_per_class = 904, 7734, 1820, 352, 19706, 581, 45, 48, 48, 1457, 4, 912, 854, 177, 195, 0, 408, 0, 171, 540, 2823, 5270
#anchors =  32, 36,  41, 88,  67, 57,  51,146, 123, 66,  81,104, 144,189, 267,365, 538,597
#counters_per_class = 904, 7734, 1820, 352, 19706, 581, 45, 48, 48, 1457, 4, 912, 854, 177, 195, 0, 408, 0, 171, 540, 2823, 5270
# Kaggle mods
classes=22
# end Kaggle mods
num=6
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
random=1
resize=1.5
nms_kind=greedynms
beta_nms=0.6

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 23

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=81
activation=linear

[yolo]
mask = 0,1,2
anchors =  16, 18,  20, 44,  36, 27,  39, 46,  28, 73,  69, 56,  75,115, 154,204, 294,313
counters_per_class = 904, 7734, 1820, 352, 19706, 581, 45, 48, 48, 1457, 4, 912, 854, 177, 195, 0, 408, 0, 171, 540, 2823, 5270
#anchors =  32, 36,  41, 88,  67, 57,  51,146, 123, 66,  81,104, 144,189, 267,365, 538,597
#counters_per_class = 904, 7734, 1820, 352, 19706, 581, 45, 48, 48, 1457, 4, 912, 854, 177, 195, 0, 408, 0, 171, 540, 2823, 5270
classes=22
num=6
jitter=0.4
gaussian_noise=1
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = 0.7
truth_thresh = 1
random=1
resize=1.5
nms_kind=greedynms
beta_nms=0.6
